{
  "schema_version": "1.1",
  "recipe_id": "unique-recipe-id",
  "title": "Pink Grapefruit Cake",
  "description": "from Ad Hoc at Home by Thomas Keller",
  "labels": ["dessert", "baking"],
  "creator": {
    "user_id": "2",
    "username": "alex",
    "email": "alex@union.io"
  },
  "ingredients": [
    {
      "groupName": "For the cake",
      "items": [
        {
          "name": "AP flour",
          "quantity": "2 cups (250 g)"
        },
        {
          "name": "baking powder",
          "quantity": "1 3/4 teaspoons"
        },
        {
          "name": "salt",
          "quantity": "1 teaspoon"
        },
        {
          "name": "granulated sugar",
          "quantity": "1 2/3 cups (367 g)"
        },
        {
          "name": "large eggs",
          "quantity": "2"
        },
        {
          "name": "milk",
          "quantity": "1 cup"
        },
        {
          "name": "oil",
          "quantity": "3/4 cup"
        },
        {
          "name": "grated grapefruit zest",
          "quantity": "1 tablespoon"
        },
        {
          "name": "vanilla extract",
          "quantity": "1 teaspoon"
        }
      ]
    },
    {
      "groupName": "For the syrup",
      "items": [
        {
          "name": "grapefruit juice",
          "quantity": "1 cup"
        },
        {
          "name": "sugar",
          "quantity": "2/3 cup (150 g)"
        }
      ]
    }
  ],
  "instructions": [
    "Preheat your oven to 350F and grease your loaf pan. In retrospect, I probably would have lined it with greased parchment paper, too.",
    "Whisk together the flour, baking powder, and salt, and set aside.",
    "Using the whisk attachment on your stand mixer, or good old fashioned elbow grease, beat the sugar and eggs together until the mixture increases in volume and the whisk leaves a trail.",
    "Beat in the milk, then the oil, then the zest, and the vanilla. Turn the mixer to low and add the flour, mixing until just incorporated. Pour the batter into your loaf pan and bake on a baking sheet for 60 minutes, rotating after 30. If you have extra batter that you want to bake in mini-pots or muffin tins, I'd probably start checking them around 25 minutes. They're done when the middle springs back when you press on it.",
    "While the cake is baking, make the syrup by simmering the juice and sugar together until the sugar is dissolved. Bring it to a boil, and then reduce to simmer for about 1 minute. As soon as you pull the cake out of the oven, use a skewer to poke holes all over and then pour the syrup over the cake. It will seem like the cake is drowning in syrup, but don't worry because it will all be absorbed as the cake cools.",
    "Let the cake cool before turning it out and glazing it. For the glaze, the recipe calls for 4 tsps grapefruit juice and 3/4 cup powdered sugar; but you may need to mix in more or less sugar until the glaze is the consistency you want."
  ],
  "yield": "Number of servings not specified"
}
